{
    "listings": [
        {
            "memberSince": 1563899759,
            "responseTime": 1,
            "recentDelivery": 1740861025000,
            "title": "develop and design PHP website or web applications",
            "rating": 5,
            "ordersInQueue": 0,
            "repeatScore": true,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$200-$400",
            "comment": "After 4 years of using Fiverr, Huzaifa is the absolute best developer we have worked with. If you are new to Fiverr, many \"developers\" you work with are only the English speaking person and they have someone else doing the coding. This is NOT the case with Huzaifa. He works directly with you and he is an expert coder. This has significantly streamlined our project timelines. His expertise is extremely impressive and his communication is outstanding. Thank you again Huzaifa for all of your hard work!",
            "reviewer_country_code": "US",
            "created_at": "2025-01-31T22:04:51",
            "value": 5,
            "score": 0.8270323,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 164217786,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1563899759,
            "responseTime": 1,
            "recentDelivery": 1740861025000,
            "title": "develop and design PHP website or web applications",
            "rating": 5,
            "ordersInQueue": 0,
            "repeatScore": true,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$50-$100",
            "comment": "Huzaifa is the real deal. This developer is an expert in coding, he is extremely timely and proactive, and he has excellent communication skills, which made this project much easier to manage. He was able to get a complex Laravel program up and running for us within a very short timeframe. I would highly recommend. Thank you Huzaifa!",
            "reviewer_country_code": "US",
            "created_at": "2025-01-26T00:42:04",
            "value": 5,
            "score": 0.60485154,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 164217786,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1563899759,
            "responseTime": 1,
            "recentDelivery": 1740861025000,
            "title": "develop and design PHP website or web applications",
            "rating": 5,
            "ordersInQueue": 0,
            "repeatScore": true,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$800-$1,000",
            "comment": "⭐ Exceptional Developer – A True Game-Changer! ⭐\n\nWorking with Huzaifa Ahmed has been an absolute pleasure from start to finish. His unparalleled coding expertise, deep understanding of software development, and unwavering commitment to excellence truly set him apart. What impressed me the most was not just his technical skills but his proactive problem-solving approach, meticulous attention to detail, and ability to turn complex challenges into seamless solutions.\n\nBeyond his technical prowess, Huzaifa is an exceptional communicator who takes the time to truly understand project goals, ensuring every milestone is met with precision and efficiency. His level of professionalism, responsiveness, and dedication to delivering high-quality results made the entire development process smooth, stress-free, and even exciting!\n\nIf you're looking for a reliable, innovative, and highly skilled developer, I can't recommend Huzaifa enough. He is, without a doubt, one of the best professionals I’ve had the pleasure of working with, and I look forward to collaborating with him again in the future. 5 stars all the way! ⭐⭐⭐⭐⭐",
            "reviewer_country_code": "US",
            "created_at": "2025-02-28T04:21:50",
            "value": 5,
            "score": 0.601686,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 164217786,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 4,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1563899759,
            "responseTime": 1,
            "recentDelivery": 1740861025000,
            "title": "develop and design PHP website or web applications",
            "rating": 5,
            "ordersInQueue": 0,
            "repeatScore": true,
            "order_duration_in_days": 2,
            "order_price_range_usd": "$800-$1,000",
            "comment": "I had the pleasure of working with Huzai for recent bug fixes and UI enhancements on our website, and I couldn’t be happier with the results. Their attention to detail, quick turnaround, and expertise as a full-stack developer were outstanding. They not only resolved the issues efficiently but also improved the user interface, making the site more polished and user-friendly. Communication was smooth throughout, and they delivered exactly what was needed. Highly recommended for any web development work.",
            "reviewer_country_code": "CA",
            "created_at": "2024-12-17T23:11:57",
            "value": 5,
            "score": 0.52930814,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 164217786,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 24,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1563899759,
            "responseTime": 1,
            "recentDelivery": 1740861025000,
            "title": "develop and design PHP website or web applications",
            "rating": 5,
            "ordersInQueue": 0,
            "repeatScore": true,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$800-$1,000",
            "comment": "Working with Huzaifa was an EXCEPTIONAL experience! His attention to detail in software development is remarkable, and his quick responsiveness and politeness made the project run smoothly. He worked with me every step of the way and made all the updates and edits I wanted plus gave his own input! Highly recommended! 👌",
            "reviewer_country_code": "CR",
            "created_at": "2025-02-28T18:47:44",
            "value": 5,
            "score": 0.47917032,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 164217786,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 7,
            "is_cancelled_order": false
        }
    ]
}