{
    "listings": [
        {
            "memberSince": 1599757289,
            "responseTime": 1,
            "recentDelivery": 1740872889000,
            "title": "develop ecommerce website by woocommerce",
            "rating": 5,
            "ordersInQueue": 4,
            "repeatScore": true,
            "order_duration_in_days": 72,
            "order_price_range_usd": "$100-$200",
            "comment": "Nazmul did an outstanding job creating my website! he truly understood how to bring my ideas. The website looks professional, good, and everything was delivered as per my request, Nazmul was always patient and helpful throughout the process. I highly recommend him to anyone in need of a high-quality work. \nThanks.",
            "reviewer_country_code": "US",
            "created_at": "2024-12-31T06:15:10",
            "value": 5,
            "score": 0.5946304,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 174386320,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 3,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1599757289,
            "responseTime": 1,
            "recentDelivery": 1740872889000,
            "title": "develop ecommerce website by woocommerce",
            "rating": 5,
            "ordersInQueue": 4,
            "repeatScore": true,
            "order_duration_in_days": 17,
            "order_price_range_usd": "$200-$400",
            "comment": "Project summary...\nBuggy deliverables, complaining, threats to delete his work, unmet expectations, more excuses, little attention to detail, need to repeat questions, incomplete responses, headaches, frustration, and more excuses.\n\nThrough his actions and words, Nazmul made it clear that he wanted to get the project off his desk as quickly as possible and was not interested in delivering what he had agreed to when he took on the project.\n\nNazmul started the project with confidence. However, throughout the process, things fell apart very quickly. He was unable to deliver what we'd agreed upon. A detailed document with all deliverables was supplied BEFORE he took the project on, and he could not provide solutions to many of the deliverables on the list. \n\nThere were many excuses made about why he was unable to do the job, and he complained several times about how long it was taking him to complete the project - despite removing several deliverables from the list. Even at the end of the project, he agreed to complete things one way. Days would pass, and he would have an excuse about why he could not do the job. I would not recommend Nazmul to anyone else. The project was stressful, and the source of headaches every day I had to deal with his work.\n\nThere's also a serious language barrier (I speak English, but he does not). Several times, Nazmul threatened to remove all the work he'd done because we said he was not fulfilling the project requirements as described, which he agreed to.\nThe entire project was one of the worst I'd ever done here on Fiverr.\n\nI will have to hire a second Fiverr freelancer to fix some of the buggy work and administration setups that Nazmul produced because it was so far off the expectations. At some point during the project, we had to limit what we asked him to complete so that we could get basic functionality on our website.\n\nDo yourself a favor and just choose a different freelancer. Nazmul is not capable beyond the basic WordPress/WooCommerce functionalities, and if your website has any theme customization, he quickly reaches his limits and won't be able to complete what you ask him to do in your project briefing. More excuses and complaints with no real resolution follow this.",
            "reviewer_country_code": "US",
            "created_at": "2025-02-24T22:23:45",
            "value": 1,
            "score": 0.55,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 174386320,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 5,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1599757289,
            "responseTime": 1,
            "recentDelivery": 1740872889000,
            "title": "develop ecommerce website by woocommerce",
            "rating": 5,
            "ordersInQueue": 4,
            "repeatScore": true,
            "order_duration_in_days": 7,
            "order_price_range_usd": "$100-$200",
            "comment": "Mr. Nazmul is truly one of the most talented designers I have ever worked with. His professionalism, keen eye for detail, and dedication to perfection make him exceptional at what he does. No challenge is too great for him, and he consistently delivers outstanding results. Thank you so much—I look forward to collaborating with you again!",
            "reviewer_country_code": "TR",
            "created_at": "2025-02-25T12:28:54",
            "value": 5,
            "score": 0.47510234,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 174386320,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1599757289,
            "responseTime": 1,
            "recentDelivery": 1740872889000,
            "title": "develop ecommerce website by woocommerce",
            "rating": 5,
            "ordersInQueue": 4,
            "repeatScore": true,
            "order_duration_in_days": 14,
            "order_price_range_usd": "$400-$600",
            "comment": "From the very first moment I met Nazmul, I felt I was in good hands. He was caring and attentive to every single detail, responding quickly to everything.\nAbove all, the final result is nothing short of amazing.\nThere’s no doubt we will return to work with him on our future projects.\n\n",
            "reviewer_country_code": "IL",
            "created_at": "2025-01-15T12:39:58",
            "value": 5,
            "score": 0.42977083,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 174386320,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 3,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1599757289,
            "responseTime": 1,
            "recentDelivery": 1740872889000,
            "title": "develop ecommerce website by woocommerce",
            "rating": 5,
            "ordersInQueue": 4,
            "repeatScore": true,
            "order_duration_in_days": 11,
            "order_price_range_usd": "$400-$600",
            "comment": "Nazmul was amazing to work with. Very reliable, honest, and easy to communicate with him at all times with any questions we had. Really simplified it for us as well.",
            "reviewer_country_code": "US",
            "created_at": "2025-02-28T19:37:21",
            "value": 5,
            "score": 0.32117116,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 174386320,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        }
    ]
}