{
    "listings": [
        {
            "memberSince": 1603103851,
            "responseTime": 1,
            "recentDelivery": 1740877099000,
            "ordersInQueue": 25,
            "order_duration_in_days": 15,
            "order_price_range_usd": "$400-$600",
            "comment": "Working with Jehan on my website was nothing short of incredible! He went above and beyond in every way, completely exceeding my expectations through the roof. I am beyond excited, blessed, and grateful to have had the opportunity to work with him and now share his incredible craft with others.\n\nJehan is truly a visionary. He doesn’t just design websites, he brings brands and stories to life in the most breathtaking way. There were so many moments throughout this process where I found myself in tears because of how beautiful and powerful the site was, and the story it tells. 100 stars!!!! ⭐️ ⭐️⭐️⭐️⭐️ \n\nNo price could ever truly measure the value of what he has created for me. ",
            "reviewer_country_code": "US",
            "created_at": "2025-03-01T02:02:53",
            "value": 5,
            "score": 0.8916215,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 185817166,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1603103851,
            "responseTime": 1,
            "recentDelivery": 1740877099000,
            "ordersInQueue": 25,
            "order_duration_in_days": 68,
            "order_price_range_usd": "$600-$800",
            "comment": "Working with Jehan on my website was an absolute pleasure. From the very beginning, his communication was clear, consistent, and thoughtful. He really took the time to understand what I wanted and made sure I felt involved throughout the entire process. It never felt like I was just another project—he genuinely cared about getting it right.\n\nJehan’s creativity blew me away. He came up with ideas and design elements I never would have thought of, and they made the site look incredible. It’s clear he has a real eye for design and knows how to make something not just functional, but beautiful and unique.\n\nOn top of that, his knowledge and expertise were so reassuring. Anytime I had a question or concern, he explained things in a way that made sense without ever making me feel out of my depth. He’s clearly a pro at what he does, and it shows in the quality of his work.\n\nThe whole experience was smooth, enjoyable, and honestly exceeded my expectations. If you’re looking for someone who’s talented, reliable, and easy to work with, I can’t recommend Jehan enough. The website he built for me is everything I hoped for and more.",
            "reviewer_country_code": "US",
            "created_at": "2025-02-14T14:40:23",
            "value": 5,
            "score": 0.88252676,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 185817166,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1603103851,
            "responseTime": 1,
            "recentDelivery": 1740877099000,
            "ordersInQueue": 25,
            "order_duration_in_days": 9,
            "order_price_range_usd": "$200-$400",
            "comment": "I've given Jehan a perfect rating on every level! Not to try and be nice but because he actually thrived in every element making this website. He knows what his customers want and he has higher expectations than other website designers. Plus he delivered the website in super fast fashion!\n\nHe communicates like an expert and speaks very good English. I will only trust my website with Jehan!!!\n\nThanks again mate! Super happy :)",
            "reviewer_country_code": "AU",
            "created_at": "2025-02-06T20:31:23",
            "value": 5,
            "score": 0.85752934,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 185817166,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 31,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1603103851,
            "responseTime": 1,
            "recentDelivery": 1740877099000,
            "ordersInQueue": 25,
            "order_duration_in_days": 5,
            "order_price_range_usd": "$200-$400",
            "comment": "I’d never used fiverr so I was extremely nervous but Jehan is an ABSOLUTE GEM!!!! As meticulous and as critical as I am, he blew it out of the water! He made every single adjustment that I asked for and assured me he would do what it takes to make sure I’m happy with the outcome. He was extremely thorough, has patience that’s out of this world, answered every single question I had, completed it well before the expected date and even recorded a video tutorial to ensure my success going forward. To simply say Jehan exceeded my expectations would be an understatement. There isn’t anyone else I would’ve rather worked with. He was a huge blessing to me and I couldn’t possibly thank him enough ❤️❤️❤️",
            "reviewer_country_code": "US",
            "created_at": "2025-01-15T13:36:43",
            "value": 5,
            "score": 0.8008474,
            "repeat_buyer": false,
            "is_business": true,
            "gig_id": 185817166,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1603103851,
            "responseTime": 1,
            "recentDelivery": 1740877099000,
            "ordersInQueue": 25,
            "order_duration_in_days": 3,
            "order_price_range_usd": "$200-$400",
            "comment": "I don't even know where to begin. Jehan exceeded my expectations in every way. The website looks incredible, he was so fast I couldn't believe it, and he made all the updates I requested practically immediately. If you're thinking of going with anyone else, you'd be making a mistake. Jehan is the best, hands down. Thanks again my friend!",
            "reviewer_country_code": "AU",
            "created_at": "2024-12-05T14:51:42",
            "value": 5,
            "score": 0.7850969,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 185817166,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 6,
            "is_cancelled_order": false
        }
    ]
}