{
    "listings": [
        {
            "memberSince": 1616834377,
            "responseTime": 1,
            "recentDelivery": 1740841221000,
            "ordersInQueue": 19,
            "order_duration_in_days": 61,
            "order_price_range_usd": "$800-$1,000",
            "comment": "Working with Rehan was great. I gave him a detailed document of everything I was looking for & he exceeded my expectations. Everything was quick & easy. He would reach out when he needed clarification instead of assuming what I meant in my overview, which I was happy about because he was able to truly reflect my vision of the website. He was very polite & kind throughout the entirety of the project which made this experience really great for me since I was not as familiar with web design. He recommended better alternatives regarding hosting sites & website plans that would best enhance my efforts with the website, going above & beyond his role to help me succeed. Thank you, Rehan",
            "reviewer_country_code": "CA",
            "created_at": "2025-01-02T14:30:26",
            "value": 5,
            "score": 0.8489108,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 212182134,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1616834377,
            "responseTime": 1,
            "recentDelivery": 1740841221000,
            "ordersInQueue": 19,
            "order_duration_in_days": 34,
            "order_price_range_usd": "$100-$200",
            "comment": "One of the best freelancers on fiverr currently. And I know this because I’ve used this platform for several years and completed several jobs. If you are looking for a web developer who really knows their stuff, Rehan is your guy! A+++",
            "reviewer_country_code": "US",
            "created_at": "2025-02-26T04:54:19",
            "value": 5,
            "score": 0.83692056,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 212182134,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 35,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1616834377,
            "responseTime": 1,
            "recentDelivery": 1740841221000,
            "ordersInQueue": 19,
            "order_duration_in_days": 117,
            "order_price_range_usd": "$200-$400",
            "comment": "I would have loved to give Rehan a five-star rating. He was kind, patient, and responsive throughout the project. However, the form used for account registration on my website was not user-friendly, and the changes I requested were not possible. Additionally, some issues I had raised were not fully resolved, requiring me to follow up multiple times.\n\nThat said, Rehan delivered great work overall, and I’m happy with the changes that were implemented. While the project took longer than expected to go live—partly due to my delayed responses—it was a well-executed job in the end.",
            "reviewer_country_code": "AU",
            "created_at": "2025-02-09T19:43:53",
            "value": 4,
            "score": 0.8251833,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 212182134,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1616834377,
            "responseTime": 1,
            "recentDelivery": 1740841221000,
            "ordersInQueue": 19,
            "order_duration_in_days": 1,
            "order_price_range_usd": "Up to $50",
            "comment": "Excellent Work! Being a CEO of the company it was an amazing experience with this freelancer I have worked with many people but never seen such a honest and loyal person in my entire life I would Strongly recommend Him to Everyone for development task. ",
            "reviewer_country_code": "US",
            "created_at": "2025-02-18T10:09:36",
            "value": 5,
            "score": 0.746837,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 212182134,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 29,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1616834377,
            "responseTime": 1,
            "recentDelivery": 1740841221000,
            "ordersInQueue": 19,
            "order_duration_in_days": 38,
            "order_price_range_usd": "$200-$400",
            "comment": "I recently had my website redesigned, and I couldn't be happier with the results! From our very first conversation, they took the time to truly understand my vision and brand identity. Their creativity and attention to detail really impressed me—I could tell they were invested in making sure every element worked seamlessly and looked amazing.\n\nThroughout the entire process, they kept me in the loop with regular updates, listened to my feedback, and offered valuable suggestions that improved the overall functionality and user experience. The final design is not only visually stunning but also easy to navigate, and I've already received compliments from clients who appreciate the new, modern look.\n\nIf you’re looking for someone who’s both professional and passionate about web design, I highly recommend working with them. They exceeded my expectations and delivered a site that perfectly represents my business!",
            "reviewer_country_code": "CA",
            "created_at": "2025-02-19T17:50:37",
            "value": 5,
            "score": 0.6907894,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 212182134,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 62,
            "is_cancelled_order": false
        }
    ]
}