{
    "listings": [
        {
            "memberSince": 1647248782,
            "responseTime": 1,
            "recentDelivery": 1740835968000,
            "ordersInQueue": 18,
            "order_duration_in_days": 35,
            "order_price_range_usd": "$600-$800",
            "comment": "The developer maintained professional politeness throughout our interaction, which I appreciated. However, the final deliverables fell short of expectations in several areas. The lack of attention to detail was evident in multiple instances - there were inconsistencies in formatting and several oversights in the project requirements that had been clearly outlined. While they responded promptly to messages, the work required significant revisions to meet the original specifications. The final result, even after feedback, didn't fully align with what we had initially discussed. Given these factors, I would suggest more thorough quality checks and closer adherence to project requirements. ",
            "reviewer_country_code": "US",
            "created_at": "2025-01-17T00:49:55",
            "value": 3.3,
            "score": 0.84983253,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 252312428,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1647248782,
            "responseTime": 1,
            "recentDelivery": 1740835968000,
            "ordersInQueue": 18,
            "order_duration_in_days": 36,
            "order_price_range_usd": "$1,000-$1,500",
            "comment": "If you're looking for a gorgeous marketing site to be built from scratch, you simply shouldn't look any further. Ala and his team delivered a stunning final product with multiple pages, dynamic icons, CTAs etc. without too much exact guidance on what it should look like or branding. If there were sections I didn't have any ideas in mind for, he and his team would get creative and suggest 2-3 different options that might fit well. These guys are pros, thank you!",
            "reviewer_country_code": "CA",
            "created_at": "2025-01-27T15:16:38",
            "value": 5,
            "score": 0.7342334,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 252312428,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1647248782,
            "responseTime": 1,
            "recentDelivery": 1740835968000,
            "ordersInQueue": 18,
            "order_duration_in_days": 28,
            "order_price_range_usd": "$200-$400",
            "comment": "Ala was incredible to work with. He and his team delivered an exceptional project considering the timeline and costs. I'm very picky with who I work with and the design I had them develop was a bit complicated. Ala was very communicative if he needed extra explanations or wanted to review details. I'm very very pleased with the final product and would definitely work with Ala again in the future. Incredible site development and nice attention to details in animations. Love it.",
            "reviewer_country_code": "US",
            "created_at": "2024-12-25T21:11:35",
            "value": 5,
            "score": 0.6746226,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 252312428,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 4,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1647248782,
            "responseTime": 1,
            "recentDelivery": 1740835968000,
            "ordersInQueue": 18,
            "order_duration_in_days": 5,
            "order_price_range_usd": "$50-$100",
            "comment": "He is exceptional in website development. Has a lot of great ideas and skills that helped make our design come to life. He was exceptionally quick in developing the complete site with all functionality within a very short time and was very helpful in making edits per our requests. Highly recommend!",
            "reviewer_country_code": "CY",
            "created_at": "2025-01-31T11:03:48",
            "value": 5,
            "score": 0.6625912,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 252312428,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 79,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1647248782,
            "responseTime": 1,
            "recentDelivery": 1740835968000,
            "ordersInQueue": 18,
            "order_duration_in_days": 12,
            "order_price_range_usd": "$200-$400",
            "comment": "1st) initially he did well but he started asking me questions about the other pages and after I answered with examples he still didn't get the work done. Then he asked for an extension which I asked why and he just replied he needed one. Then after I have him a 7 day extension I responded with detailed corrections and changes and then a day later he submitted delivery after receiving an extension with changes still not made. ",
            "reviewer_country_code": "US",
            "created_at": "2025-01-13T18:28:46",
            "value": 1.7,
            "score": 0.55,
            "repeat_buyer": false,
            "is_business": true,
            "gig_id": 252312428,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 24,
            "is_cancelled_order": false
        }
    ]
}