{
    "listings": [
        {
            "memberSince": 1422025471,
            "responseTime": 1,
            "recentDelivery": 1740212476000,
            "ordersInQueue": 0,
            "order_duration_in_days": 3,
            "order_price_range_usd": "$50-$100",
            "comment": "I honestly felt so bad that I made him wait so long to pay him! I made him wait a couple of months after he spent 10 hours to finish my website. But he didn't complain, he worked on it and made it very beautiful! after I paid him the money he deserved, he continued to help me to set up the domain and he made my website out there for the world to see. thank you! for your hard work and patience!!!!! I totally recommend him",
            "reviewer_country_code": "US",
            "created_at": "2025-02-16T03:48:47",
            "value": 5,
            "score": 0.8839681,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 293928566,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 49,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1422025471,
            "responseTime": 1,
            "recentDelivery": 1740212476000,
            "ordersInQueue": 0,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$100-$200",
            "comment": "I couldn’t be happier with the work Saqib did on my website! From the very beginning, he demonstrated exceptional professionalism, creativity, and attention to detail. He took the time to understand my vision and translated it into a sleek, user-friendly design that truly exceeded my expectations.\n\nSaqib's communication throughout the process was outstanding, with regular updates and quick responses to my questions. He even suggested innovative features that I hadn’t considered, which have significantly enhanced the functionality and user experience of the site.\n\nThe final result is not just visually stunning but also performs flawlessly. I’ve already received countless compliments from clients, and my website traffic has noticeably increased since the launch.\n\nI would highly recommend Saqib to anyone looking for a talented, reliable, and creative professional. He doesn’t just build websites—he creates digital experiences that deliver real results!",
            "reviewer_country_code": "GB",
            "created_at": "2025-01-08T16:42:03",
            "value": 5,
            "score": 0.774807,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 293928566,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 148,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1422025471,
            "responseTime": 1,
            "recentDelivery": 1740212476000,
            "ordersInQueue": 0,
            "order_duration_in_days": 21,
            "order_price_range_usd": "$100-$200",
            "comment": "It's my first website and I didn't know where to start and how to do it but Saqib was able to come up a good structure and content with my very brief intro of what my business is all about. There were many things that I've requested him to change and he was very patient and very quick in responding. He also went above and beyond to make a video to show me how to edit my website. \n\nThank you so much for your help! ",
            "reviewer_country_code": "SG",
            "created_at": "2024-12-03T13:06:36",
            "value": 5,
            "score": 0.7678321,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 293928566,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1422025471,
            "responseTime": 1,
            "recentDelivery": 1740212476000,
            "ordersInQueue": 0,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$50-$100",
            "comment": "Outstanding WordPress Developer – Saqib Exceeded All Expectations!\nWe had the absolute pleasure of working with Saqib on our WordPress website, and the experience was nothing short of exceptional. From start to finish, he showcased professionalism, creativity, and an impressive ability to bring our vision to life.\n\nExpertise & WordPress Mastery\nSaqib is incredibly knowledgeable when it comes to WordPress. Whether it was customizing themes, optimizing site performance, or integrating advanced features, he handled everything with ease. He knows how to get the most out of WordPress, ensuring that our site runs smoothly, looks stunning, and remains easy to manage on the backend.\n\nDesign & User Experience\nOne of the biggest highlights of working with Saqib was his ability to create a site that is not only beautiful but also incredibly user-friendly. He carefully designed every element to enhance the user experience, ensuring seamless navigation and a professional, modern look. Our site now feels polished, engaging, and optimized for conversions.\n\nCommunication & Professionalism\nSaqib’s communication was outstanding throughout the project. He was always responsive, kept us updated at every stage, and patiently addressed all of our questions. He took the time to understand our goals and worked collaboratively to ensure the final product aligned perfectly with our brand.\n\nProblem-Solving & Customization\nNo request was too big or small—Saqib handled every challenge with a problem-solving mindset. From tweaking WordPress plugins to refining our SEO setup, he customized everything to fit our specific needs. His attention to detail and ability to troubleshoot any issues quickly made all the difference.\n\nTimeliness & Reliability\nSaqib delivered everything on time and even ahead of schedule. He is highly reliable, ensuring that all tasks were completed efficiently without sacrificing quality. His professionalism and dedication gave us total peace of mind throughout the project.\n\nOngoing Support & Maintenance\nEven after launching the site, Saqib has continued to provide invaluable support. Whether it's minor updates, security enhancements, or performance optimizations, he’s always available to help. Having a dependable WordPress expert on hand makes a world of difference!\n\nFinal Thoughts\nIf you’re looking for a skilled, reliable, and creative WordPress developer, look no further than Saqib.",
            "reviewer_country_code": "GB",
            "created_at": "2025-01-30T10:45:35",
            "value": 5,
            "score": 0.64766616,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 293928566,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 148,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1422025471,
            "responseTime": 1,
            "recentDelivery": 1740212476000,
            "ordersInQueue": 0,
            "order_duration_in_days": 64,
            "order_price_range_usd": "$1,500-$2,000",
            "comment": "My project is one that has many complicated steps and being in different time zones adds even more complication to everything. But Saqib and his team have been very polite and very patient with me throughout everything. I can’t thank these guys enough for helping me throughout this journey. ",
            "reviewer_country_code": "MX",
            "created_at": "2025-02-22T09:46:43",
            "value": 5,
            "score": 0.5711238,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 293928566,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 14,
            "is_cancelled_order": false
        }
    ]
}