{
    "listings": [
        {
            "memberSince": 1689059222,
            "responseTime": 1,
            "recentDelivery": 1740832123000,
            "ordersInQueue": 2,
            "order_duration_in_days": 5,
            "order_price_range_usd": "$200-$400",
            "comment": "Ketan was amazing to work with. Hiring someone on the other side of the world to create something so essential to your business might create anxiety for some. But, that concern is needless! Ketan is obviously gifted in the work he does and his creativity is blended with his masterful attention to detail. He was able to take my clunky attempt at a website and create something that others would have charged me thousands to do!  If you need a website, either one you have begun or need one from scratch, talk to Ketan. He will exceed your expectations in every way. Thank you Ketan!",
            "reviewer_country_code": "US",
            "created_at": "2025-02-13T13:20:13",
            "value": 5,
            "score": 0.8812784,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 327734257,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1689059222,
            "responseTime": 1,
            "recentDelivery": 1740832123000,
            "ordersInQueue": 2,
            "order_duration_in_days": 7,
            "order_price_range_usd": "$200-$400",
            "comment": "We at Seamless Living LLC. highly recommend Ketan for all of your website needs. He is very professional and kept us informed every step of the way. Our new website looks amazing thanks to Ketan! I will be coming back to him, and recommending Ketan to all of my friends who need a website created or redesigned. Thank you again Ketan!!! ",
            "reviewer_country_code": "US",
            "created_at": "2025-02-13T07:54:22",
            "value": 5,
            "score": 0.7835107,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 327734257,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1689059222,
            "responseTime": 1,
            "recentDelivery": 1740832123000,
            "ordersInQueue": 2,
            "order_duration_in_days": 5,
            "order_price_range_usd": "$200-$400",
            "comment": "Ketan went above and beyond in redesigning our Wix website. Not only did he deliver a beautifully designed, well-organized site, but he also provided valuable additional content that will benefit our business in the long run. His attention to detail, creativity, and willingness to go the extra mile truly set him apart. Communication was smooth throughout the process, and he ensured every aspect of the site was functional and visually appealing. Highly recommend his services to anyone looking for a professional and dedicated web designer!",
            "reviewer_country_code": "US",
            "created_at": "2025-01-29T19:28:54",
            "value": 5,
            "score": 0.72111887,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 327734257,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1689059222,
            "responseTime": 1,
            "recentDelivery": 1740832123000,
            "ordersInQueue": 2,
            "order_duration_in_days": 14,
            "order_price_range_usd": "$200-$400",
            "comment": "Working with Ketan has been an exceptional experience. Calling him a professional doesn’t do justice to the level of dedication and excellence he brings to his work. He consistently goes above and beyond, setting a new standard for professionalism. This has easily been one of the best experiences I’ve had on Fiverr.\n\nI’m someone who holds high expectations for myself and those I collaborate with, and it’s rare to find someone who matches that level of commitment. Ketan not only meets but exceeds those expectations. His responsiveness is remarkable—he’s available at all hours, and I honestly wonder when he finds time to sleep.\n\nIf you’re considering working with him, don’t hesitate. I couldn’t recommend him more highly!",
            "reviewer_country_code": "US",
            "created_at": "2025-01-04T01:26:15",
            "value": 5,
            "score": 0.71482587,
            "repeat_buyer": true,
            "is_business": true,
            "gig_id": 327734257,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 15,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1689059222,
            "responseTime": 1,
            "recentDelivery": 1740832123000,
            "ordersInQueue": 2,
            "order_duration_in_days": 4,
            "order_price_range_usd": "$200-$400",
            "comment": "Ketan is exceptional in website development. Has a lot of great ideas and skills that helped make our design come to life. He was exceptionally quick in developing the complete site with all functionality within 48 hours and was very helpful in making edits per our requests. Highly recommend!",
            "reviewer_country_code": "US",
            "created_at": "2025-01-19T17:12:29",
            "value": 5,
            "score": 0.67409253,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 327734257,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 5,
            "is_cancelled_order": false
        }
    ]
}