{
    "listings": [
        {
            "memberSince": 1690356824,
            "responseTime": 1,
            "recentDelivery": 1740908231000,
            "title": "build custom wordpress website design , website development",
            "rating": 4.9,
            "ordersInQueue": 9,
            "repeatScore": true,
            "order_duration_in_days": 30,
            "order_price_range_usd": "$200-$400",
            "comment": "Amazing Website Design & Outstanding Service!\n\nWorking with Ammara has been an absolute pleasure! She created a stunning website for my commercial and house cleaning company that not only exceeded my expectations but also outshines any of the local competitors' sites. Ammara took the time to truly understand my vision, incorporating all the best elements from the examples I provided, and turned them into something even better.\n\nWhat really sets her apart is her dedication to delivering excellence. Not only did she design a visually appealing and user-friendly website, but she also optimized it for SEO. Within a short time, my site started ranking on Google, bringing in more inquiries and helping my business grow. It’s clear she knows her craft inside and out.\n\nThe cherry on top? Ammara offers lifetime support for the website. Anytime I have a question or need a tweak, she’s just a message away. She really holds your hand throughout the entire process, making sure you’re 100% happy with the final result. Her professionalism, creativity, and commitment to her clients are unmatched.\n\nIf you're looking for someone to bring your vision to life and take your business to the next level, I can’t recommend Ammara enough. She’s an absolute gem, and I’m so grateful for her incredible work.",
            "reviewer_country_code": "CA",
            "created_at": "2025-01-17T14:46:55",
            "value": 5,
            "score": 0.83378303,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 331152964,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 69,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1690356824,
            "responseTime": 1,
            "recentDelivery": 1740908231000,
            "title": "build custom wordpress website design , website development",
            "rating": 4.9,
            "ordersInQueue": 9,
            "repeatScore": true,
            "order_duration_in_days": 4,
            "order_price_range_usd": "$50-$100",
            "comment": "Ammara was nothing short of incredible. She genuinely went above and beyond, I was so impressed. My web developer is away at the moment and I needed someone to urgently help me with the integration of an affiliate marketing program into the landing page of my website. Not only did she get back to me within minutes, she meticulously researched the integration process, did the entire integration so quickly, tested it and was super thorough to ensure a seamless tracking process, knowing that it's a really imperative that it correctly tracks. She then happily added some testimonials to my landing page when I asked, even though that wasn't necessarily part of the job description, she understood that it's really crucial to drive conversions and that my web developer is a away, so she helped me out. She also offered me unlimited support if there are any issues with the integration going forward. There won't be any issues I'm confident she did an amazing job. She was a pleasure to work with and just an extremely lovely person. I highly recommend her. 6 stars out of 5!",
            "reviewer_country_code": "AU",
            "created_at": "2025-01-02T12:15:14",
            "value": 5,
            "score": 0.8032104,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 331152964,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 5,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1690356824,
            "responseTime": 1,
            "recentDelivery": 1740908231000,
            "title": "build custom wordpress website design , website development",
            "rating": 4.9,
            "ordersInQueue": 9,
            "repeatScore": true,
            "order_duration_in_days": 7,
            "order_price_range_usd": "Up to $50",
            "comment": "She was great at the task in hand. Not only was the communication great but the final result i would trust her with again with any of my upcoming projects for my website. If you're having to choose a website developer youve found one of if not the best here.",
            "reviewer_country_code": "US",
            "created_at": "2025-01-24T12:32:41",
            "value": 5,
            "score": 0.73201805,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 331152964,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1690356824,
            "responseTime": 1,
            "recentDelivery": 1740908231000,
            "title": "build custom wordpress website design , website development",
            "rating": 4.9,
            "ordersInQueue": 9,
            "repeatScore": true,
            "order_duration_in_days": 21,
            "order_price_range_usd": "$100-$200",
            "comment": "The end product met my expectations. Ammara was very friendly and responsive. I would have preferred a live discussion to review details, which I think would have reduced the delivery time for my project. There was a lot of back and forth with questions that had already been answered. However, I am satisfied with the end product. Ammara had great design ideas that I would not have thought of. I am pleased with the results. ",
            "reviewer_country_code": "US",
            "created_at": "2024-12-30T14:47:50",
            "value": 4.3,
            "score": 0.7136436,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 331152964,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 6,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1690356824,
            "responseTime": 1,
            "recentDelivery": 1740908231000,
            "title": "build custom wordpress website design , website development",
            "rating": 4.9,
            "ordersInQueue": 9,
            "repeatScore": true,
            "order_duration_in_days": 9,
            "order_price_range_usd": "$200-$400",
            "comment": "Working with Ammara was an incredible experience! Her technical skills and expertise are unmatched, and she handled every aspect of my project with precision and care. From seamless payment integration to a beautifully designed layout, she exceeded all my expectations. Despite my many changes, she worked tirelessly and responded quickly to every request. The final result is beyond what I imagined. I’m 100% satisfied and confident Ammara will remain my go-to developer for life! Thank you for this project!!",
            "reviewer_country_code": "TT",
            "created_at": "2025-01-15T18:37:55",
            "value": 5,
            "score": 0.6867945,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 331152964,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 18,
            "is_cancelled_order": false
        }
    ]
}