{
    "listings": [
        {
            "memberSince": 1432105211,
            "responseTime": 1,
            "recentDelivery": 1740904172000,
            "title": "create wordpress website design and development",
            "rating": 4.9,
            "ordersInQueue": 20,
            "repeatScore": true,
            "order_duration_in_days": 243,
            "order_price_range_usd": "$100-$200",
            "comment": "I feel incredibly grateful and LUCKY to have found Ramiz to help build my website. He went above and beyond anything I could have expected. Ramiz is super responsive, professional, polite, and incredibly patient (and trust me, I’m not the easiest client to deal with, lol). If it weren’t for his follow-through and support, I’m not sure I would have completed the project. I was going through a very difficult time in my personal life, and he was so understanding and encouraging, helping me see the project through to completion. No one has ever treated me with so much patience and kindness, and I will be forever grateful to him.\n\nRamiz is also exceptionally talented and extremely knowledgeable about web development, SEO, and creative design. As someone who isn’t very skilled with technology and gets overwhelmed easily, I cannot overstate how reassuring and helpful he was throughout the process. He made everything so much less stressful and even went out of his way to create custom instructional videos specifically for my site!\n\nBy far, Ramiz is the best professional I’ve ever worked with for my online business. I only wish I could hire him for all my technical projects! If you’re considering working with him, don’t hesitate—you won’t find anyone better. Thank you, Ramiz, for your outstanding work. You will always be my go-to website guy for any future projects.",
            "reviewer_country_code": "US",
            "created_at": "2024-12-10T20:08:49",
            "value": 5,
            "score": 0.88671035,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 34845690,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1432105211,
            "responseTime": 1,
            "recentDelivery": 1740904172000,
            "title": "create wordpress website design and development",
            "rating": 4.9,
            "ordersInQueue": 20,
            "repeatScore": true,
            "order_duration_in_days": 13,
            "order_price_range_usd": "$200-$400",
            "comment": "Ramiz delivered my website prior to the expected delivery date and made edits that I asked for.  He also took the time to make a video showing me how to make edits to my own website and ensuring I had what I needed to make my website live (domain + hosting site).  He was thorough, efficient, and patient.  Great work and I will definitely go to Ramiz for additional website needs!",
            "reviewer_country_code": "US",
            "created_at": "2024-12-17T01:51:36",
            "value": 4,
            "score": 0.8098705,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 34845690,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1432105211,
            "responseTime": 1,
            "recentDelivery": 1740904172000,
            "title": "create wordpress website design and development",
            "rating": 4.9,
            "ordersInQueue": 20,
            "repeatScore": true,
            "order_duration_in_days": 53,
            "order_price_range_usd": "$100-$200",
            "comment": "Stop everything you’re doing—because if you need a rockstar website developer (WordPress Elementor), look no further than Ramiz! From start to finish, he was extremely accessible, always quick to respond, and made every change I requested at lightning speed. The final website is nothing short of stunning—clean, modern, and exactly what I had envisioned.\n\nA special shoutout also goes to his team member Pravin, who was instrumental in supporting the project behind the scenes. Together, they brought my dream website to life, and I couldn’t be more grateful for their incredible talent and dedication. If you want a killer website, Ramiz (and Pravin!) are the way to go—hands down!\n\n\n\n\n\n\n",
            "reviewer_country_code": "SA",
            "created_at": "2025-01-16T03:59:07",
            "value": 5,
            "score": 0.80120134,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 34845690,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 37,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1432105211,
            "responseTime": 1,
            "recentDelivery": 1740904172000,
            "title": "create wordpress website design and development",
            "rating": 4.9,
            "ordersInQueue": 20,
            "repeatScore": true,
            "order_duration_in_days": 13,
            "order_price_range_usd": "$200-$400",
            "comment": "First time working with Fiverr as well as having someone create a website for my business, the process and communication with Ramiz was professional and prompt. The price was fair and I will be maintaining a relationship with Ramiz for my future website needs. I would recommend working with him.",
            "reviewer_country_code": "US",
            "created_at": "2025-01-28T16:03:35",
            "value": 5,
            "score": 0.7815472,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 34845690,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1432105211,
            "responseTime": 1,
            "recentDelivery": 1740904172000,
            "title": "create wordpress website design and development",
            "rating": 4.9,
            "ordersInQueue": 20,
            "repeatScore": true,
            "order_duration_in_days": 21,
            "order_price_range_usd": "$200-$400",
            "comment": "This was my first time using Fiverr to hire someone for work so I was sceptical. Ramiz was exceptional and exceeded all my expectations. I could not recommend him highly enough. Great communication and fantastic service. If you’re looking for someone to make a website for you - he is your guy. ",
            "reviewer_country_code": "AU",
            "created_at": "2025-02-23T02:27:42",
            "value": 5,
            "score": 0.76547843,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 34845690,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        }
    ]
}