{
    "listings": [
        {
            "memberSince": 1486509331,
            "responseTime": 3,
            "recentDelivery": 1740752090000,
            "ordersInQueue": 0,
            "order_duration_in_days": 37,
            "order_price_range_usd": "$600-$800",
            "comment": "Andrew exceeded all our expectations, and we couldn't be happier with the outcome. If you need a top-notch web developer, look no further. Andrew N. is the one to contact!  See for yourselves: https://rkmechanicalairservices.com/\n\nWe approached Andrew N. to check our existing website, and he immediately stood out from other fiverr pros by recording a detailed and very helpfull video even before we placed any order. In the video, he broke down all the issues our website had and explained how they should be fixed. Andrew was incredibly polite and patient, answering all our questions and even getting on a call with us prior to us placing an order.\n\nWhen he started working on developing a new website based on the old version, he transformed everything into a piece of gold. His deep understanding of coding made it easy to execute any requirements we had. His expertise in UX design made our website high on conversion potential. The entire process was smooth, pleasant, and exciting.\n\nAfter having bad experiences with other web developers before finding Andrew, I was thrilled to finally find someone who truly knows what he's doing. Andrew brought his expertise to the table, offering insights and advise based on his understanding of our business, and transformed the website organization and purpose, instead of just following a plain, simple template, with no deep analytics. It was so-so-so refreshing!\n\nIf I could give 10-star review, I would! \n\nAndrew, thank you so much! Cannot wait to work with you on our other projects!\n",
            "reviewer_country_code": "BY",
            "created_at": "2024-12-21T17:01:25",
            "value": 5,
            "score": 0.89712155,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 362239747,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 8,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1486509331,
            "responseTime": 3,
            "recentDelivery": 1740752090000,
            "ordersInQueue": 0,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$400-$600",
            "comment": "Andrew was quick to understand our requirements and with his exceptional skills crafted exactly what we wanted to represent our corporate image, in the form of snappy website. He is a consummate professional. He focuses on the task at hand and gets things delivered on time, without cutting edges in functionality or quality. Well done.",
            "reviewer_country_code": "GB",
            "created_at": "2025-02-01T17:37:41",
            "value": 5,
            "score": 0.53659713,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 362239747,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 4,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1486509331,
            "responseTime": 3,
            "recentDelivery": 1740752090000,
            "ordersInQueue": 0,
            "order_duration_in_days": 26,
            "order_price_range_usd": "$1,000-$1,500",
            "comment": "Andrei is an outstanding professional with exceptional attention to detail and a customer-oriented approach. It was a true pleasure to work with him, thanks to his dedication, clear communication, and impeccable documentation. He exceeded expectations with tailored, well-thought-out solutions, demonstrating a rare level of professionalism. I highly recommend him!",
            "reviewer_country_code": "RO",
            "created_at": "2025-01-19T02:42:07",
            "value": 5,
            "score": 0.38604984,
            "repeat_buyer": false,
            "is_business": true,
            "gig_id": 362239747,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 4,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1486509331,
            "responseTime": 3,
            "recentDelivery": 1740752090000,
            "ordersInQueue": 0,
            "order_duration_in_days": 3,
            "order_price_range_usd": "$200-$400",
            "comment": "Andrew is the best! He is very thoughtful and detail oriented while still having a very string technical base where he can code almost anything. ",
            "reviewer_country_code": "US",
            "created_at": "2025-02-07T18:35:28",
            "value": 5,
            "score": 0.36252177,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 362239747,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 3,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1486509331,
            "responseTime": 3,
            "recentDelivery": 1740752090000,
            "ordersInQueue": 0,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$50-$100",
            "comment": "Andrew N. was phenomenal in developing my landing page! He exceeded expectations with his attention to detail and consistent communication. Working with him is always so great with his quick with deliveries, and always goes ABOVE AND BEYOND 🙌. Highly recommend!",
            "reviewer_country_code": "US",
            "created_at": "2024-11-05T16:57:21",
            "value": 5,
            "score": 0,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 362239747,
            "relevancy_score": 0,
            "reviews_count_as_buyer": 5,
            "is_cancelled_order": false
        }
    ]
}