{
    "listings": [
        {
            "memberSince": 1607172199,
            "responseTime": 1,
            "recentDelivery": 1740564579000,
            "ordersInQueue": 0,
            "order_duration_in_days": 27,
            "order_price_range_usd": "$200-$400",
            "comment": "Note: Everyone’s requests can make a difference, and I’m sharing my experience.\n\nAt first, the work did not meet expectations at all. However, it got better over time as the seller improved communication. That said, I had to give step-by-step guidance many times, and even then, some tasks were not done correctly. There was a clear lack of attention to detail - not just in creativity, but even in basic tasks like aligning boxes and pages, which were repeatedly missed. My team and I had to remind the seller about these details several times. I do appreciate their efforts to fix the issues, though.\n\nAs for the timeline, the project was not finished on time. It was supposed to take 15 days but ended up taking more than 18. Although it was delayed, the seller did try to complete it.\n\nOverall, the work was just average - not great, but not terrible either. However, for the price and the amount of guidance I had to give, it was disappointing and not worth it. The service was advertised as providing user-friendly and well-designed results, but it required constant supervision and still didn’t meet expectations. That said, I appreciate the seller’s willingness to improve and hope they continue to get better.",
            "reviewer_country_code": "GB",
            "created_at": "2025-02-26T10:37:46",
            "value": 1.3,
            "score": 0.55,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 369837710,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1607172199,
            "responseTime": 1,
            "recentDelivery": 1740564579000,
            "ordersInQueue": 0,
            "order_duration_in_days": 31,
            "order_price_range_usd": "$50-$100",
            "comment": "My experience was overall unsatisfactory. A custom theme was initially promised, but instead, Webflow code was used within Elementor boxes. This not only caused unexpected delays in completing the project but also resulted in a slow website performance due to the excessive number of plugins used.\n\nAnother disappointment was the lack of skill in handling basic corrections, which became apparent on several occasions. The slow response time to messages also did nothing to alleviate my concerns. These issues forced me to seek alternative solutions to meet the initial project requirements.\n\nOverall, despite efforts to offer improvements, the lack of experience with custom themes and poor communication severely impacted my impression of the service.\n\nUltimately, I opted for a partial cancellation to fairly acknowledge the work done by Link Tech, while addressing the remaining needs of my project with another, more experienced freelancer.",
            "reviewer_country_code": "CH",
            "created_at": "2025-02-23T03:11:32",
            "value": 1,
            "score": 0.55,
            "repeat_buyer": false,
            "is_business": true,
            "gig_id": 369837710,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 9,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1607172199,
            "responseTime": 1,
            "recentDelivery": 1740564579000,
            "ordersInQueue": 0,
            "order_duration_in_days": 12,
            "order_price_range_usd": "$100-$200",
            "comment": "I recently worked with Link on the creation of my website and I am extremely satisfied with the end result. \nHe demonstrated excellent communication skills throughout the entire project. He was always available to discuss any concerns and provided clear updates on the site's progress. His promptness and ability to understand my needs made the development process smooth and stress-free.\nLink mj showed a strong command of the latest web technologies and industry best practices. He is skilled in coding, design and optimisation, delivering a functional and aesthetically pleasing site.\nThe project was completed in a reasonable time frame, meeting the deadlines set at the beginning. Link demonstrated extraordinary creativity in the design of the site. he managed to capture the essence of my brand and translate it into a visually engaging and user-friendly interface. His attention to detail and innovative design solutions exceeded my expectations.\nConsidering the quality of the work provided, the service offered was excellent value. The price was transparent and fair, with no hidden costs.\n\nIn conclusion, I am extremely satisfied with Link and would definitely recommend his services to anyone in need of a professional and well-designed website. ",
            "reviewer_country_code": "IT",
            "created_at": "2024-07-22T05:40:38",
            "value": 5,
            "score": 0,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 369837710,
            "relevancy_score": 0,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1607172199,
            "responseTime": 1,
            "recentDelivery": 1740564579000,
            "ordersInQueue": 0,
            "order_duration_in_days": 11,
            "order_price_range_usd": "$100-$200",
            "comment": "I am happy of how my website turns out. Though the starting part was rough because it did not meet my expectations, but they were able to turn the table around and made sure everything is according to my requests. They are very capable but they must have shown it from the start. Overall it was a great experience. Thank you. ",
            "reviewer_country_code": "AU",
            "created_at": "2024-07-18T10:04:27",
            "value": 4.3,
            "score": 0,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 369837710,
            "relevancy_score": 0,
            "reviews_count_as_buyer": 5,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1607172199,
            "responseTime": 1,
            "recentDelivery": 1740564579000,
            "ordersInQueue": 0,
            "order_duration_in_days": 4,
            "order_price_range_usd": "Up to $50",
            "comment": "Thank you, Abdullah for an outstanding experience and an amazing website.\nHighly Recommended!",
            "reviewer_country_code": "US",
            "created_at": "2024-06-02T09:51:10",
            "value": 5,
            "score": 0,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 369837710,
            "relevancy_score": 0,
            "reviews_count_as_buyer": 203,
            "is_cancelled_order": false
        }
    ]
}