{
    "listings": [
        {
            "memberSince": 1716790070,
            "responseTime": 1,
            "recentDelivery": 1740859607000,
            "ordersInQueue": 1,
            "order_duration_in_days": 10,
            "order_price_range_usd": "$100-$200",
            "comment": "I am beyond impressed with Bilal’s work! He created a website that completely exceeded my expectations—it’s absolutely amazing. From the very beginning, Bilal’s communication was flawless. He not only followed all my requests to the letter but also offered valuable insights and expertise when it came to web hosting and the technical delivery of the site. His attention to detail and dedication to getting everything just right was evident in every step of the process. I honestly can’t thank him enough for the incredible result. I’ll miss working with him and, without a doubt, I’ll think of Bilal every time I open my website. Highly recommend!",
            "reviewer_country_code": "PK",
            "created_at": "2024-12-08T21:22:58",
            "value": 5,
            "score": 0.8122431,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 382173990,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 2,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1716790070,
            "responseTime": 1,
            "recentDelivery": 1740859607000,
            "ordersInQueue": 1,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$50-$100",
            "comment": "Bilal is a creative genius when it comes to website design. I shared my vision with him, and he didn’t just build a website — he crafted an experience that perfectly reflected what I had in mind. His first draft was impressive, and with every piece of feedback I gave, he refined the design even further, always with patience and precision. If you want a modern, eye-catching website and a designer who truly listens and delivers, Bilal is the one to work with.",
            "reviewer_country_code": "US",
            "created_at": "2025-02-26T16:07:03",
            "value": 5,
            "score": 0.80885005,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 382173990,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 14,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1716790070,
            "responseTime": 1,
            "recentDelivery": 1740859607000,
            "ordersInQueue": 1,
            "order_duration_in_days": 2,
            "order_price_range_usd": "$100-$200",
            "comment": "Bilal has done an absolutely amazing job on our website. He understood exactly what I wanted to achieve and brought our vision to life perfectly with fast delivery. Bilal went above and beyond to ensure every detail was incorporated just the way we needed it. He is highly professional, and the website looks fantastic. I’m really looking forward to working with Bilal again in the future as our website continues to grow and evolve. Thank you so much, Bilal!",
            "reviewer_country_code": "US",
            "created_at": "2025-01-22T17:45:23",
            "value": 5,
            "score": 0.73239064,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 382173990,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1716790070,
            "responseTime": 1,
            "recentDelivery": 1740859607000,
            "ordersInQueue": 1,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$50-$100",
            "comment": "Bilal exceeded all my expectations! He carefully listened to my ideas and made sure every detail was just right. His patience and professionalism made the entire process smooth and stress-free. When it came to WordPress website development, his expertise truly stood out.No matter what revisions I requested, he handled everything with ease and ensured I was 100% satisfied. His skills in website development are top-notch, and now I understand why he has so many 5-star reviews! I highly recommend his services to anyone looking for high-quality work.",
            "reviewer_country_code": "GB",
            "created_at": "2025-02-19T12:00:41",
            "value": 5,
            "score": 0.67763156,
            "repeat_buyer": false,
            "is_business": true,
            "gig_id": 382173990,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 15,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1716790070,
            "responseTime": 1,
            "recentDelivery": 1740859607000,
            "ordersInQueue": 1,
            "order_duration_in_days": 4,
            "order_price_range_usd": "$100-$200",
            "comment": "I worked with Bilal to redesign my website, and he did an incredible job! From the start, he understood exactly what I needed and made the whole process seamless. His attention to detail and responsiveness really stood out, and he made sure everything was completed on time with top-notch quality. If you’re looking for someone reliable and talented for your website design, I can’t recommend Bilal enough. I’m definitely looking forward to working with him again!",
            "reviewer_country_code": "GB",
            "created_at": "2025-01-17T21:05:51",
            "value": 5,
            "score": 0.6717226,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 382173990,
            "relevancy_score": 1,
            "reviews_count_as_buyer": 17,
            "is_cancelled_order": false
        }
    ]
}