{
    "listings": [
        {
            "memberSince": 1721155155,
            "responseTime": 1,
            "recentDelivery": 1739463110000,
            "ordersInQueue": 0,
            "order_duration_in_days": 8,
            "order_price_range_usd": "$100-$200",
            "comment": "I had a great experience working with Sameer Ahmed in Website Development. His professionalism and attention to detail ensured a flawless, bug-free deliverable. Additionally, his proactive communication, in-depth understanding, and politeness made the collaboration seamless.",
            "reviewer_country_code": "US",
            "created_at": "2025-02-14T01:26:09",
            "value": 4.7,
            "score": 0.42456234,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 387020280,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 8,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1721155155,
            "responseTime": 1,
            "recentDelivery": 1739463110000,
            "ordersInQueue": 0,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$200-$400",
            "comment": "I had the pleasure of working with Sameer for the second time, and once again, he delivered exceptional results! The quality of his work is outstanding, and he truly went above and beyond to meet my expectations. What really sets him apart is his speed—my project was completed in just 10 hours without compromising on quality. Sameer's professionalism, expertise, and quick turnaround time make him an absolute gem on Fiverr. I highly recommend his services and look forward to working with him again!",
            "reviewer_country_code": "EG",
            "created_at": "2024-10-12T22:07:37",
            "value": 5,
            "score": 0,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 387020280,
            "relevancy_score": 0,
            "reviews_count_as_buyer": 4,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1721155155,
            "responseTime": 1,
            "recentDelivery": 1739463110000,
            "ordersInQueue": 0,
            "order_duration_in_days": 1,
            "order_price_range_usd": "$100-$200",
            "comment": "Working with Sameer was an outstanding experience from start to finish. He delivered five beautifully designed, responsive web pages in record time—under 24 hours! What impressed me most was his dedication to excellence. Throughout the project, Sameer was incredibly supportive, always available, and open to every piece of feedback. He took the time to understand not only the technical requirements but also the essence and vision of the website, translating it into an exceptional final product.\n\nSameer's attention to detail is flawless, and his work ethic is inspiring. He demonstrates a rare combination of skill, efficiency, and genuine care for his clients' success. I couldn't have asked for a better freelance developer; he'd have them all if 20 stars were an option! I highly recommend Sameer to anyone seeking a reliable, responsive developer dedicated to delivering extraordinary results.",
            "reviewer_country_code": "EG",
            "created_at": "2024-10-11T16:16:06",
            "value": 5,
            "score": 0,
            "repeat_buyer": true,
            "is_business": false,
            "gig_id": 387020280,
            "relevancy_score": 0,
            "reviews_count_as_buyer": 4,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1721155155,
            "responseTime": 1,
            "recentDelivery": 1739463110000,
            "ordersInQueue": 0,
            "order_duration_in_days": 7,
            "order_price_range_usd": "$100-$200",
            "comment": "Exceptional work with top-notch service, seamless communication, and impressive value for money",
            "reviewer_country_code": "US",
            "created_at": "2024-10-08T11:45:16",
            "value": 5,
            "score": 0,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 387020280,
            "relevancy_score": 0,
            "reviews_count_as_buyer": 66,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1721155155,
            "responseTime": 1,
            "recentDelivery": 1739463110000,
            "ordersInQueue": 0,
            "order_duration_in_days": 6,
            "order_price_range_usd": "$50-$100",
            "comment": "I highly recommend this seller! They took my website’s performance to the next level, boosting my PageSpeed Insights score to an impressive 99. The speed optimization was flawless, and they efficiently fixed all the bugs, especially the display issues on mobile and tablet. Communication was seamless throughout the process, and their recommendation to use the LiteSpeed Cache plugin made a significant difference. If you're looking for someone to enhance your site’s speed and functionality, this is the seller to choose. Outstanding work!",
            "reviewer_country_code": "US",
            "created_at": "2024-10-01T17:28:26",
            "value": 5,
            "score": 0,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 387020280,
            "relevancy_score": 0,
            "reviews_count_as_buyer": 75,
            "is_cancelled_order": false
        }
    ]
}