{
    "listings": [
        {
            "memberSince": 1703502720,
            "responseTime": 1,
            "recentDelivery": 1740830273000,
            "ordersInQueue": 19,
            "order_duration_in_days": 13,
            "order_price_range_usd": "$50-$100",
            "comment": "Designed a good website. However tortured me so much until he transferred it. He keeps saying I will check and get back to you. He transferred it first to a domain that was not mine. The problem is that when there is any issue, he doesn't ask, he just leaves it and keeps promising he'll get back to you, and never does. In the end the website was transferred to me with a lot of errors, media was not displaying and I had to re edit it my self. The seller can do good stuff as per the design but he definitely has communication problems. ",
            "reviewer_country_code": "BY",
            "created_at": "2025-01-28T12:17:05",
            "value": 3,
            "score": 0.93679434,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 391266887,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 379,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1703502720,
            "responseTime": 1,
            "recentDelivery": 1740830273000,
            "ordersInQueue": 19,
            "order_duration_in_days": 3,
            "order_price_range_usd": "$50-$100",
            "comment": "Arif was great at creating custom features for my website and he was very timely with the delivery. He was able to turn around my website and create a great look. He was very professional and was able to provide custom features for a reasonable price.",
            "reviewer_country_code": "CY",
            "created_at": "2025-02-20T16:04:12",
            "value": 5,
            "score": 0.6343112,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 391266887,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 53,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1703502720,
            "responseTime": 1,
            "recentDelivery": 1740830273000,
            "ordersInQueue": 19,
            "order_duration_in_days": 13,
            "order_price_range_usd": "$200-$400",
            "comment": "!!!Customer Warning!!!\nI rarely write negative reviews, but my experience warrants sharing this as a cautionary tale. I hired Arif to build a stock portfolio website for $1,500, divided into three deliverables. As part of the project, I provided him with the username and password to the website I wanted replicated. My intention, as a software developer, was to use his foundational work as a basis for me to upgrade and maintain the website going forward.\n\nThe first deliverable was to create Figma files for the entire website, for which I paid $369.25. We agreed upon the requirements, and he was given 10 days to complete the design with slight modifications to the reference website I provided. I followed up three days before the deadline, and he reassured me that everything was on track. However, on the day of the deadline, he delivered two incomplete and carelessly hand-drawn pages that fell drastically short of expectations. To provide context, I’ve attached a public link showcasing the work he submitted.\n\nhttps://drive.google.com/file/d/1IVjTDz9nT831pJiMQVry_DhpTitbQ0sA/view?usp=sharing\n\nDespite his high ratings, my experience suggests they may not reflect the reality of his work. I strongly recommend seeking an alternative freelancer for your project needs.\n",
            "reviewer_country_code": "US",
            "created_at": "2025-01-16T21:28:08",
            "value": 1,
            "score": 0.55,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 391266887,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": true
        },
        {
            "memberSince": 1703502720,
            "responseTime": 1,
            "recentDelivery": 1740830273000,
            "ordersInQueue": 19,
            "order_duration_in_days": 16,
            "order_price_range_usd": "$50-$100",
            "comment": "Arif Mahamud is a stellar website developer! His PROFESSIONALISM and CODE EXPERTISE truly stand out, combined with top-notch documentation. Working with him was seamless, thanks to his LANGUAGE FLUENCY and deep understanding of the project. Very efficient, good communication, and recommended for everyone who wants a professional worker. 👍",
            "reviewer_country_code": "NO",
            "created_at": "2024-12-03T15:21:06",
            "value": 5,
            "score": 0.48554477,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 391266887,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 1,
            "is_cancelled_order": false
        },
        {
            "memberSince": 1703502720,
            "responseTime": 1,
            "recentDelivery": 1740830273000,
            "ordersInQueue": 19,
            "order_duration_in_days": 20,
            "order_price_range_usd": "$400-$600",
            "comment": "Arif is awesome to work with! He speaks fluent English and grasps and delivers what you want done. We have already hired him to do a second project and have a third lined up. I highly recommend him! :)",
            "reviewer_country_code": "US",
            "created_at": "2024-12-08T14:03:15",
            "value": 5,
            "score": 0.42063618,
            "repeat_buyer": false,
            "is_business": false,
            "gig_id": 391266887,
            "relevancy_score": 0.5,
            "reviews_count_as_buyer": 49,
            "is_cancelled_order": false
        }
    ]
}